Vorlesung/ParProg-Multiprocessing.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="de" xml:lang="de">
<head>
<!-- 2017-11-01 Wed 15:02 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Parallelprogrammierung &#x2013; Multiprocessing</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Johannes Brauer" />
<link rel="stylesheet" type="text/css" href="styles/bigblow/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/bigblow/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="styles/bigblow/css/hideshow.css"/>
<link rel="stylesheet" type="text/css" href="mycss/mystyle.css" />
</head>
<body>
<div id="content">
<h1 class="title">Parallelprogrammierung &#x2013; Multiprocessing</h1>

<div id="outline-container-org29937c2" class="outline-2">
<h2 id="org29937c2">Multiprocessing &#x2013; Grundlagen</h2>
<div class="outline-text-2" id="text-org29937c2">
</div><div id="outline-container-org2d95dba" class="outline-3">
<h3 id="org2d95dba">A first multiprocessing example in C</h3>
<div class="outline-text-3" id="text-org2d95dba">
</div><div id="outline-container-orgf3b3d60" class="outline-4">
<h4 id="orgf3b3d60">Overview</h4>
<div class="outline-text-4" id="text-orgf3b3d60">
<p>
&#x2026; key points of the <i>unnamed pipe example</i>
</p>

<ul class="org-ul">
<li><p>
When the program pipeExample.c is compiled and then executed from
the command-line, it executes as a process. Here's the command to
execute:
</p>
<pre class="example">
% ./pipeExample   ## On Windows: % pipeExample

</pre></li>
<li>The executing pipeExample is the <i>parent</i> process.</li>
<li>The parent process calls the library function fork() to spawn a
<i>child</i> process, a clone of the parent.
<ul class="org-ul">
<li>The library function fork() makes a system call to the OS routine that spawns the child.</li>
<li>The library function fork() returns one of three values:
<dl class="org-dl">
<dt>-1</dt><dd>to signal failure (e.g., the system already has too
many processes)</dd>
<dt>0</dt><dd>to the child process</dd>
<dt>&gt; 0</dt><dd>to the parent process; in particular, the <i>process id</i>
(pid) of the child is returned to the parent, and a pid
is always a positive integer</dd>
</dl></li>
<li>The parent and child process both execute the code that follows the call to fork().
<ul class="org-ul">
<li>fork() effectively <i>clones</i> one process (child) from another (parent).</li>
<li><p>
An if-else or equivalent construct is used to ensure that the
parent does one thing and the child does something else.
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #6434A3;">pid_t</span> <span style="color: #BA36A5;">pid</span> = fork<span style="color: #707183;">()</span>;   <span style="color: #8D8D84;">/** </span><span style="color: #8D8D84; font-style: italic;">pid_t is a signed integer data type *</span><span style="color: #8D8D84;">*/</span>
<span style="color: #0000FF;">if</span> <span style="color: #707183;">(</span>-1 == pid<span style="color: #707183;">)</span> <span style="color: #707183;">{</span>      <span style="color: #8D8D84;">/** </span><span style="color: #8D8D84; font-style: italic;">error: couldn't clone a new process *</span><span style="color: #8D8D84;">*/</span>
    ...                
<span style="color: #707183;">}</span>   
<span style="color: #0000FF;">else</span> <span style="color: #0000FF;">if</span> <span style="color: #707183;">(</span>0 == pid<span style="color: #707183;">)</span> <span style="color: #707183;">{</span>  <span style="color: #8D8D84;">/** </span><span style="color: #8D8D84; font-style: italic;">child code follows *</span><span style="color: #8D8D84;">*/</span>
    ...
<span style="color: #707183;">}</span>
<span style="color: #0000FF;">else</span> <span style="color: #707183;">{</span>                <span style="color: #8D8D84;">/** </span><span style="color: #8D8D84; font-style: italic;">parent code follows *</span><span style="color: #8D8D84;">*/</span>
    ...
<span style="color: #707183;">}</span></pre>
</pre>
</div></li>
</ul></li>
<li>The parent waits for the child to exit so that the child does not
become a „zombie“.
<ul class="org-ul">
<li>When a child terminates, the OS notifies the parent. If the
parent is already terminated, it cannot be notified&#x2013;and the
child becomes an „zombie“, dead but still around.</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgfbd2ea8" class="outline-4">
<h4 id="orgfbd2ea8">using the shell</h4>
<div class="outline-text-4" id="text-orgfbd2ea8">
<div class="org-src-container">
<pre class="src src-sh">bash-3.2$ ls pipeExample.c 
pipeExample.c
bash-3.2$ gcc -o pipeExample pipeExample.c 
bash-3.2$ ./pipeExample
This is the winter of our discontent
bash-3.2$ </pre>
</pre>
</div>
</div>
</div>
