Vorlesung/ParProg-Multiprocessing.html
<div id="outline-container-org7cb1dec" class="outline-4">
<h4 id="org7cb1dec">using the shell</h4>
<div class="outline-text-4" id="text-org7cb1dec">
<div class="org-src-container">
<pre class="src src-sh">bash-3.2$ ./fifoWriter &amp;
<span style="color: #707183;">[</span>1<span style="color: #707183;">]</span> 7316
bash-3.2$ ./fifoReader
60749779
966803328
1202260494
...
<span style="color: #707183;">[</span>1<span style="color: #707183;">]</span>+  Done                    ./fifoWriter
bash-3.2$ </pre>
</pre>
</div>
</div>
</div>
<div id="outline-container-org5579eab" class="outline-4">
<h4 id="org5579eab">Source Code <code>fifoWriter.c</code></h4>
<div class="outline-text-4" id="text-org5579eab">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #808080;">#include</span> <span style="color: #707183;">&lt;</span><span style="color: #008000;">fcntl.h</span><span style="color: #707183;">&gt;</span> 
<span style="color: #808080;">#include</span> <span style="color: #707183;">&lt;</span><span style="color: #008000;">stdio.h</span><span style="color: #707183;">&gt;</span>
<span style="color: #808080;">#include</span> <span style="color: #707183;">&lt;</span><span style="color: #008000;">time.h</span><span style="color: #707183;">&gt;</span>
<span style="color: #808080;">#include</span> <span style="color: #707183;">&lt;</span><span style="color: #008000;">stdlib.h</span><span style="color: #707183;">&gt;</span>
<span style="color: #808080;">#include</span> <span style="color: #707183;">&lt;</span><span style="color: #008000;">unistd.h</span><span style="color: #707183;">&gt;</span>
<span style="color: #808080;">#include</span> <span style="color: #707183;">&lt;</span><span style="color: #008000;">sys/stat.h</span><span style="color: #707183;">&gt;</span>
<span style="color: #808080;">#include</span> <span style="color: #707183;">&lt;</span><span style="color: #008000;">sys/types.h</span><span style="color: #707183;">&gt;</span>

<span style="color: #808080;">#define</span> <span style="color: #BA36A5;">MaxWrites</span> 256  

<span style="color: #6434A3;">int</span> <span style="color: #006699;">main</span><span style="color: #707183;">()</span> <span style="color: #707183;">{</span>
  srand<span style="color: #7388D6;">(</span>time<span style="color: #909183;">(</span>0<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>; <span style="color: #8D8D84;">/* </span><span style="color: #8D8D84; font-style: italic;">seed the random number generator </span><span style="color: #8D8D84;">*/</span>

  <span style="color: #0000FF;">const</span> <span style="color: #6434A3;">char</span>* <span style="color: #BA36A5;">fifoName</span> = <span style="color: #008000;">"./myPipe1"</span>;          
  mkfifo<span style="color: #7388D6;">(</span>fifoName, 0666<span style="color: #7388D6;">)</span>; <span style="color: #8D8D84;">/* </span><span style="color: #8D8D84; font-style: italic;">read/write for user/group/others </span><span style="color: #8D8D84;">*/</span>             <span style="color: #8D8D84;">/** </span><span style="color: #8D8D84; font-style: italic;">line 1 *</span><span style="color: #8D8D84;">*/</span>
  <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">fd</span> = open<span style="color: #7388D6;">(</span>fifoName, O_CREAT | O_WRONLY<span style="color: #7388D6;">)</span>; <span style="color: #8D8D84;">/* </span><span style="color: #8D8D84; font-style: italic;">open blocks on a FIFO </span><span style="color: #8D8D84;">*/</span>   <span style="color: #8D8D84;">/** </span><span style="color: #8D8D84; font-style: italic;">line 2 *</span><span style="color: #8D8D84;">*/</span>

  <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">i</span>;
  <span style="color: #0000FF;">for</span> <span style="color: #7388D6;">(</span>i = 0; i &lt; MaxWrites; i++<span style="color: #7388D6;">)</span> <span style="color: #7388D6;">{</span> 
    <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">n</span> = rand<span style="color: #909183;">()</span>;             
    write<span style="color: #909183;">(</span>fd, &amp;n, <span style="color: #0000FF;">sizeof</span><span style="color: #709870;">(</span><span style="color: #6434A3;">int</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>;  <span style="color: #8D8D84;">/* </span><span style="color: #8D8D84; font-style: italic;">4 bytes per int </span><span style="color: #8D8D84;">*/</span>                       <span style="color: #8D8D84;">/** </span><span style="color: #8D8D84; font-style: italic;">line 3 *</span><span style="color: #8D8D84;">*/</span>
  <span style="color: #7388D6;">}</span>
  close<span style="color: #7388D6;">(</span>fd<span style="color: #7388D6;">)</span>;         <span style="color: #8D8D84;">/* </span><span style="color: #8D8D84; font-style: italic;">close the fifo </span><span style="color: #8D8D84;">*/</span>                                    <span style="color: #8D8D84;">/** </span><span style="color: #8D8D84; font-style: italic;">line 4 *</span><span style="color: #8D8D84;">*/</span>
  unlink<span style="color: #7388D6;">(</span>fifoName<span style="color: #7388D6;">)</span>;  <span style="color: #8D8D84;">/* </span><span style="color: #8D8D84; font-style: italic;">dispose of underlying file </span><span style="color: #8D8D84;">*/</span>                        <span style="color: #8D8D84;">/** </span><span style="color: #8D8D84; font-style: italic;">line 5 *</span><span style="color: #8D8D84;">*/</span>
  <span style="color: #0000FF;">return</span> 0;
<span style="color: #707183;">}</span></pre>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc7aecbd" class="outline-4">
<h4 id="orgc7aecbd">Source Code <code>fifoReader.c</code></h4>
<div class="outline-text-4" id="text-orgc7aecbd">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #808080;">#include</span> <span style="color: #707183;">&lt;</span><span style="color: #008000;">fcntl.h</span><span style="color: #707183;">&gt;</span> 
<span style="color: #808080;">#include</span> <span style="color: #707183;">&lt;</span><span style="color: #008000;">stdio.h</span><span style="color: #707183;">&gt;</span>
<span style="color: #808080;">#include</span> <span style="color: #707183;">&lt;</span><span style="color: #008000;">time.h</span><span style="color: #707183;">&gt;</span>
<span style="color: #808080;">#include</span> <span style="color: #707183;">&lt;</span><span style="color: #008000;">stdlib.h</span><span style="color: #707183;">&gt;</span>
<span style="color: #808080;">#include</span> <span style="color: #707183;">&lt;</span><span style="color: #008000;">unistd.h</span><span style="color: #707183;">&gt;</span>
<span style="color: #808080;">#include</span> <span style="color: #707183;">&lt;</span><span style="color: #008000;">sys/stat.h</span><span style="color: #707183;">&gt;</span>
<span style="color: #808080;">#include</span> <span style="color: #707183;">&lt;</span><span style="color: #008000;">sys/types.h</span><span style="color: #707183;">&gt;</span>

<span style="color: #6434A3;">int</span> <span style="color: #006699;">main</span><span style="color: #707183;">()</span> <span style="color: #707183;">{</span>
    <span style="color: #0000FF;">const</span> <span style="color: #6434A3;">char</span>* <span style="color: #BA36A5;">fifoName</span> = <span style="color: #008000;">"./myPipe1"</span>;
    <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">num</span>;
    <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">fd</span> = open<span style="color: #7388D6;">(</span>fifoName, O_RDONLY<span style="color: #7388D6;">)</span>;              <span style="color: #8D8D84;">/** </span><span style="color: #8D8D84; font-style: italic;">line 1 *</span><span style="color: #8D8D84;">*/</span>

    <span style="color: #0000FF;">while</span> <span style="color: #7388D6;">(</span>read<span style="color: #909183;">(</span>fd, &amp;num, <span style="color: #0000FF;">sizeof</span><span style="color: #709870;">(</span>num<span style="color: #709870;">)</span><span style="color: #909183;">)</span> &gt; 0<span style="color: #7388D6;">)</span>         <span style="color: #8D8D84;">/** </span><span style="color: #8D8D84; font-style: italic;">line 2 *</span><span style="color: #8D8D84;">*/</span> 
      printf<span style="color: #7388D6;">(</span><span style="color: #008000;">"%i\n"</span>, num<span style="color: #7388D6;">)</span>;
    close<span style="color: #7388D6;">(</span>fd<span style="color: #7388D6;">)</span>;                                      <span style="color: #8D8D84;">/** </span><span style="color: #8D8D84; font-style: italic;">line 3 *</span><span style="color: #8D8D84;">*/</span>
    unlink<span style="color: #7388D6;">(</span>fifoName<span style="color: #7388D6;">)</span>;                               <span style="color: #8D8D84;">/** </span><span style="color: #8D8D84; font-style: italic;">line 4 *</span><span style="color: #8D8D84;">*/</span>
    <span style="color: #0000FF;">return</span> 0;
<span style="color: #707183;">}</span></pre>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org1981a38" class="outline-3">
<h3 id="org1981a38">The Nginx Web Server</h3>
<div class="outline-text-3" id="text-org1981a38">
<p>
Multiprocessing in production-grade software: the nginx web server
</p>

<ul class="org-ul">
<li>www.nginx.com
<ul class="org-ul">
<li>The web server is written in C.</li>
<li>nginx combines multiprocessing and non-blocking I/O as concurrency mechanisms.</li>
</ul></li>

<li>nginx, like any modern web server that relies on multiprocessing for concurrency,
is a "pre-forking" server.
<ul class="org-ul">
<li>nginx can be started as a <i>system service</i> (at boot time), and is platform-neutral.</li>
</ul></li>

<li><p>
<code>nginx.conf</code>  ()configuration entries are key/value pairs: no XML!)
</p>
<pre class="example">
user www-data;           ## www-data (name is arbitrary) is owner of workers
worker_processes 4;      ## default number of workers, might be set to processor count
pid /var/run/nginx.pid;  ## file /var/run/nginx.pid stores pid of master process

events {
   worker_connections 1024;  ## Max of 1024 connections per worker 
   ...                       ## (typical browsers open at least two connections to a 
                                site per client session)
    }   
</pre></li>

<li><p>
<code>ps -ef | grep nginx</code>
</p>
<pre class="example">
Owner     pid   ppid   nginx process type

root      1803     1   master process /usr/sbin/nginx  ## command that started nginx
www-data  1804  1803   worker process
www-data  1805  1803   worker process
www-data  1807  1803   worker process
www-data  1808  1803   worker process
</pre></li>
</ul>
</div>
</div>
