Vorlesung/ParProg-Multiprocessing.html
<div id="outline-container-org17ccc73" class="outline-3">
<h3 id="org17ccc73">Execing and Forking Options in Multiprocessing</h3>
<div class="outline-text-3" id="text-org17ccc73">
<p>
A second way for one executing program to start another
</p>

<ul class="org-ul">
<li><p>
Review of the previously way, introduction of the new way:
</p>
<pre class="example">
        fork()
parent----------&gt;child        ## Both parent and child continue to execute...

         exec...()
process1-----------&gt;process2  ## process2 replaces process1, which terminates
</pre></li>
<li>In systems speak, an <i>image</i> is an executable program. For instance,
copying the system from one machine to another is called
<i>re-imaging</i>.
<ul class="org-ul">
<li>In the multiprocessing <i>pipeExample</i> code, the image is the
compiled, executable program named <i>pipeExample</i></li>
</ul></li>
<li>A new process can be <i>spawned</i> (created) under one of two distinct
scenarios, which the difference between the fork() function and the
exec-family of functions illustrates.
<ul class="org-ul">
<li>The exec-family consists of library functions that, under the
hood, make the same system call.</li>
</ul></li>
<li><p>
In a successful call to fork(), the new child process executes the
<i>same</i> image as the parent that spawned it: the forked process is a
clone. So the standard code idiom is this:
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #6434A3;">pid_t</span> <span style="color: #BA36A5;">pid</span> = fork<span style="color: #707183;">()</span>;  <span style="color: #8D8D84;">/* </span><span style="color: #8D8D84; font-style: italic;">parent executes this </span><span style="color: #8D8D84;">*/</span>
...                  <span style="color: #8D8D84;">/* </span><span style="color: #8D8D84; font-style: italic;">check for success </span><span style="color: #8D8D84;">*/</span>
<span style="color: #0000FF;">if</span> <span style="color: #707183;">(</span>0 == pid<span style="color: #707183;">)</span> <span style="color: #707183;">{</span>      <span style="color: #8D8D84;">/* </span><span style="color: #8D8D84; font-style: italic;">0 returned to the child </span><span style="color: #8D8D84;">*/</span>
   ...               <span style="color: #8D8D84;">/* </span><span style="color: #8D8D84; font-style: italic;">child code </span><span style="color: #8D8D84;">*/</span>
<span style="color: #707183;">}</span>
<span style="color: #0000FF;">else</span> <span style="color: #707183;">{</span>               <span style="color: #8D8D84;">/* </span><span style="color: #8D8D84; font-style: italic;">parent code: fork returns child's pid to parent </span><span style="color: #8D8D84;">*/</span>
   ...               <span style="color: #8D8D84;">/* </span><span style="color: #8D8D84; font-style: italic;">alternative parent test: if (pid &gt; 0)</span>
<span style="color: #8D8D84; font-style: italic;">}</span></pre>
</pre>
</div></li>
<li><p>
In a successful call to an exec-function, replaces the current process image with
a new image that's loaded into memory.
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">flag</span> = execl<span style="color: #707183;">(</span><span style="color: #008000;">"/usr/bin/myGame"</span>, <span style="color: #008000;">"myGame"</span>, 0<span style="color: #707183;">)</span>;
<span style="color: #0000FF;">if</span> <span style="color: #707183;">(</span>-1 == flag<span style="color: #707183;">)</span> perror<span style="color: #707183;">(</span><span style="color: #008000;">"Couldn't exec..."</span><span style="color: #707183;">)</span>;
<span style="color: #8D8D84;">/* </span><span style="color: #8D8D84; font-style: italic;">on success, the 'myGame' program now executes </span><span style="color: #8D8D84;">*/</span></pre>
</pre>
</div>
<ul class="org-ul">
<li>The new image has its own address space and other features. In
summary, the old process stops execution and a new one begins
execution.</li>
<li>The new process retains the pid (and ppid) of the one it replaces
<ul class="org-ul">
<li>The user and group properties are likewise unchanged.</li>
</ul></li>
</ul></li>
</ul>
</div>
<div id="outline-container-org05803bd" class="outline-4">
<h4 id="org05803bd">Using the Shell</h4>
<div class="outline-text-4" id="text-org05803bd">
<div class="org-src-container">
<pre class="src src-sh">bash-3.2$ ./fileStatus tmp
File name: tmp

Information about file tmp:

Owner ID:    503
Group ID:    20
Byte size:   68
Last access: Fri Oct  6 11:10:23 2017
File type:   directory
Owner read:  Owner readable
Owner write: Owner writable

bash-3.2$ ./fileStatus fileStatus
File name: fileStatus

Information about file fileStatus:

Owner ID:    503
Group ID:    20
Byte size:   8808
Last access: Fri Oct  6 11:12:05 2017
File type:   regular
Owner read:  Owner readable
Owner write: Owner writable

bash-3.2$ ./execing
File name: tmp

Information about file tmp:

Owner ID:    503
Group ID:    20
Byte size:   68
Last access: Fri Oct  6 11:10:23 2017
File type:   directory
Owner read:  Owner readable
Owner write: Owner writable</pre>
</pre>
</div>
</div>
</div>
<div id="outline-container-org1a6cef6" class="outline-4">
<h4 id="org1a6cef6">Source Code</h4>
<div class="outline-text-4" id="text-org1a6cef6">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #8D8D84;">/* </span><span style="color: #8D8D84; font-style: italic;">To run: </span>

<span style="color: #8D8D84; font-style: italic;">   -- compile this program (gcc -o execing execing.c) and fileStatus.c </span>
<span style="color: #8D8D84; font-style: italic;">   --                      (gcc -o fileStatus fileStatus.c)</span>
<span style="color: #8D8D84; font-style: italic;">   -- create a subdirectory named tmp: mkdir tmp</span>
<span style="color: #8D8D84; font-style: italic;">   -- from the command line: ./execing</span>

<span style="color: #8D8D84; font-style: italic;">   This program 'execs' the fileStatus program, which outputs metadata about the tmp dir..</span>
<span style="color: #8D8D84; font-style: italic;">   Here's a depiction:</span>

<span style="color: #8D8D84; font-style: italic;">                   execv</span>
<span style="color: #8D8D84; font-style: italic;">   execing program-------&gt;fileStatus program</span>
<span style="color: #8D8D84;">*/</span>

<span style="color: #808080;">#include</span> <span style="color: #707183;">&lt;</span><span style="color: #008000;">unistd.h</span><span style="color: #707183;">&gt;</span>
<span style="color: #808080;">#include</span> <span style="color: #707183;">&lt;</span><span style="color: #008000;">stdio.h</span><span style="color: #707183;">&gt;</span>
<span style="color: #808080;">#include</span> <span style="color: #707183;">&lt;</span><span style="color: #008000;">stdlib.h</span><span style="color: #707183;">&gt;</span>

<span style="color: #6434A3;">int</span> <span style="color: #006699;">main</span><span style="color: #707183;">()</span> <span style="color: #707183;">{</span>
  <span style="color: #6434A3;">char</span>* <span style="color: #0000FF;">const</span> <span style="color: #BA36A5;">args</span><span style="color: #7388D6;">[]</span> = <span style="color: #7388D6;">{</span><span style="color: #008000;">"./fileStatus"</span>, <span style="color: #008000;">"tmp"</span>, 0<span style="color: #7388D6;">}</span>;  <span style="color: #8D8D84;">/* </span><span style="color: #8D8D84; font-style: italic;">fileStatus program, tmp directory </span><span style="color: #8D8D84;">*/</span>
  <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">ret</span> = execv<span style="color: #7388D6;">(</span><span style="color: #008000;">"./fileStatus"</span>, args<span style="color: #7388D6;">)</span>;            <span style="color: #8D8D84;">/* </span><span style="color: #8D8D84; font-style: italic;">"v" for "vector" </span><span style="color: #8D8D84;">*/</span>
  <span style="color: #0000FF;">if</span> <span style="color: #7388D6;">(</span>-1 == ret<span style="color: #7388D6;">)</span> <span style="color: #7388D6;">{</span>                                  <span style="color: #8D8D84;">/* </span><span style="color: #8D8D84; font-style: italic;">check for failure </span><span style="color: #8D8D84;">*/</span>
    perror<span style="color: #909183;">(</span><span style="color: #008000;">"execv(...) error"</span><span style="color: #909183;">)</span>;
    exit<span style="color: #909183;">(</span>-1<span style="color: #909183;">)</span>;
  <span style="color: #7388D6;">}</span>
  <span style="color: #0000FF;">else</span> 
    printf<span style="color: #7388D6;">(</span><span style="color: #008000;">"I'm here\n"</span><span style="color: #7388D6;">)</span>;                           <span style="color: #8D8D84;">/* </span><span style="color: #8D8D84; font-style: italic;">never executes </span><span style="color: #8D8D84;">*/</span>
  <span style="color: #0000FF;">return</span> 0;
<span style="color: #707183;">}</span></pre>
</pre>
</div>
</div>
</div>
</div>
