Vorlesung/ParProg-Multiprocessing.html
<div id="outline-container-orgaef55a6" class="outline-3">
<h3 id="orgaef55a6">Process Tracking and Management</h3>
<div class="outline-text-3" id="text-orgaef55a6">
<p>
Process tracking and context switching
</p>

<ul class="org-ul">
<li>Each process has a unique ID (pid), a non-negative integer.
<ul class="org-ul">
<li>A process's pid is recorded in the system's process table.</li>
<li>Library functions getpid() and getppid() get the pid and the
parent's pid, respectively.</li>
<li>The pid of 0 is typically reserved for the <i>idle process</i>, the one
that <i>runs</i> when there's nothing else to run.</li>
<li>The <i>init process</i> has a pid of 1: the first user-space process
that the OS kernel spawns in the boot-up.
<ul class="org-ul">
<li>On shutdown, the init process is the last process to terminate:
it waits for all of its children.</li>
<li>The init process starts other processes: system services such as
the login service, etc.</li>
</ul></li>
</ul></li>
<li>Key data structures in a process <i>context</i>:
<ul class="org-ul">
<li>process table: tracks information per process, in particular
information that allows a pre-empted process to restart later.</li>
<li>page table(s): translate virtual into physical addresses. Each
process has its own, which effectively partitions virtual address
spaces among processes.</li>
<li>file table: tracks, per process, files that a process has opened.</li>
</ul></li>
<li>Every process has a user and group <i>owner</i>, which determines the
process's access rights to resources.
<ul class="org-ul">
<li>Every process likewise belongs to a <i>process group</i>, which
facilitates sending signals to every process in a group, to
getting information about related processes, and so on.</li>
<li>In the default case, a child process belongs to the same as its
parent.</li>
</ul></li>
<li>Most modern systems use pre-emptive scheduling, with either
fixed-length or variable-length time-slices: a process that exceeds
the time-slice on a given run is pre-empted and sent back to a
scheduling queue.
<ul class="org-ul">
<li>A process and a thread <i>context</i> consists of key information about
it.
<ul class="org-ul">
<li>For a process, key data structures such as the process table,
the file table, and its page tables define the <i>context</i>.</li>
</ul></li>
</ul></li>
<li>Context switches, which occur during pre-emption, come in two
flavors:
<ul class="org-ul">
<li>From one thread to another within the same process: <i>intraprocess
switching</i></li>
<li>From one process to another: <i>interprocess switching</i>
<ul class="org-ul">
<li>The big cost is the swapping out of one (virtual) address space
for another: page tables</li>
</ul></li>
<li>A process-level context switch is signficantly more expensive than
a thread-level context switch.
<ul class="org-ul">
<li>The cost of thread-level switching is near zero on modern systems.</li>
<li><p>
Depiction:
</p>
<pre class="example">
Process1      Process2        processor7
  Thread11      Thread21
  Thread12

1st scenario: Thread12 replaces Thread11 on processor7  + virtually no overhead

2nd scenario: Thread21 replaces Thread11 on processor7  + high overhead--
                                                          process context switch
</pre></li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org93c2a7c" class="outline-2">
<h2 id="org93c2a7c">Multiprocessing &#x2013; Vertiefung</h2>
<div class="outline-text-2" id="text-org93c2a7c">
<p>
<i>to be continued</i> &#x2026; 
</p>

<p>
Examples from 
</p>
<ul class="org-ul">
<li>node.js ++</li>
<li>ipc -</li>
<li>nginx local socket -</li>
<li>exercise  -?</li>
<li>upsides and downsides of multiprocessing +</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Autor: Johannes Brauer</p>
<p class="date">Created: 2017-11-01 Wed 15:02</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>